module.exports = {
    name: 'menu',
    execute: async (sock, m, args) => {
        const remoteJid = m.key.remoteJid;

        const menuText = `╭━━━━ ⟪ 🎀 𝔸ℝ ℍ𝔸ℂ𝕂𝔼ℝ 𝔹𝕆𝕋 🎀 ⟫ ━━━━╮
┊
┊ 🌸 𝑩𝑶𝑻 𝑶𝑾𝑵𝑬𝑹 : ℝ𝕖𝕙𝕞𝕒𝕟
┊ 🦋 𝑺𝑬𝑹𝑽𝑬𝑹    : 𝕌𝕃𝕋ℝ𝔸 ℙℝ𝔼𝕄𝕀𝕌𝕄 𝕍𝟛
┊ ✨ 𝑸𝑼𝑨𝑳𝑰𝑻𝒀   : 𝟜𝕏 𝕌𝕃𝕋ℝ𝔸
┊ 🧠 𝑻𝑯𝑰𝑵𝑲𝑰𝑵𝑮  : 𝟛𝕏 ℍ𝕀𝔾ℍ
┊ ⚡ 𝑷𝑶𝑾𝑬𝑹     : 𝟘.𝟘𝟘𝟚 𝔻𝔼𝕃𝔸𝕐
┊ 👩‍💻 𝑫𝑬𝑽𝑬𝑳𝑶𝑷𝑬𝑹 : 𝔸ℝ 𝕏 ℙ𝔸𝕂 𝕋𝔼𝔸𝕄 𝟜𝕋𝕏
┊
├┈┈┈┈┈┈┈ ✦ 🤍 ✦ ┈┈┈┈┈┈┈┤
┊
┊ 📱 𝙒𝙊𝙍𝙆𝙎 𝙄𝙉 𝙂𝙍𝙊𝙐𝙋 & 𝙋𝙍𝙄𝙑𝘼𝙏𝙀
┊
╭━━ 👑 𝒢𝓇𝑜𝓊𝓅 𝒞𝑜𝓂𝓂𝒶𝓃𝒹𝓈 🎀
┣ ❯ 🌷 .𝗮𝗱𝗱
┣ ❯ 🌷 .𝗸𝗶𝗰𝗸
┣ ❯ 🌷 .𝗿
┣ ❯ 🌷 .𝗽𝗿𝗼𝗺𝗼𝘁𝗲
┣ ❯ 🌷 .𝗱𝗲𝗺𝗼𝘁𝗲
┣ ❯ 🌷 .𝘀𝗲𝘁𝗻𝗮𝗺𝗲
┣ ❯ 🌷 .𝗹𝗶𝗻𝗸
┣ ❯ 🌷 .𝗹𝗲𝗳𝘁
┣ ❯ 🌷 .𝗱 (𝗱𝗲𝗹𝗲𝘁𝗲)
┊
╭━━ 😈 𝒞𝓇𝒶𝓏𝓎 𝒫𝓇𝒶𝓃𝓀𝓈 & 𝒜𝒸𝓉𝒾𝑜𝓃𝓈 💣
┣ ❯ ✨ .𝗯𝗼𝗺𝗯
┣ ❯ ✨ .𝗲𝗮𝗿𝘁𝗵𝗾𝘂𝗮𝗸𝗲
┣ ❯ ✨ .𝗰𝗵𝗮𝗼𝘀
┣ ❯ ✨ .𝗱𝗲𝗺𝗼𝘁𝗲𝗽𝗿𝗮𝗻𝗸
┣ ❯ ✨ .𝗷𝘂𝗺𝗽𝘀𝗰𝗮𝗿𝗲
┣ ❯ ✨ .𝗮𝗻𝗻𝗼𝘆
┣ ❯ ✨ .𝗳𝗮𝗸𝗲𝗯𝗮𝗻
┣ ❯ ✨ .𝗻𝘂𝗸𝗲𝗹𝗶𝘁𝗲
┣ ❯ ✨ .𝗿𝗲𝗮𝗱𝗺𝗼𝗿𝗲
┊
╭━━ 🎭 𝐼𝓁𝓁𝓊𝓈𝒾𝑜𝓃𝓈 & 𝐹𝒶𝓀𝑒𝓈 💅
┣ ❯ 🦋 .𝗵𝗮𝗰𝗸
┣ ❯ 🦋 .𝗵𝗮𝗰𝗸𝗰𝗮𝗺
┣ ❯ 🦋 .𝗵𝗮𝗰𝗸𝗲𝗱
┣ ❯ 🦋 .𝘃𝗶𝗿𝘂𝘀
┣ ❯ 🦋 .𝘀𝘆𝘀𝘁𝗲𝗺𝘂𝗶
┣ ❯ 🦋 .𝗯𝗮𝘁𝘁𝗲𝗿𝘆
┣ ❯ 🦋 .𝗴𝗹𝗶𝘁𝗰𝗵
┣ ❯ 🦋 .𝗶𝗱𝗲𝗻𝘁𝗶𝘁𝘆
┣ ❯ 🦋 .𝗳𝗮𝗸𝗲𝗰𝗮𝗹𝗹
┣ ❯ 🦋 .𝗳𝗮𝗸𝗲𝗿𝗲𝗽𝗹𝘆
┣ ❯ 🦋 .𝗳𝗮𝗸𝗲𝘁𝘆𝗽𝗲
┊
╭━━ 📢 𝒯𝒶𝑔𝑔𝒾𝓃𝑔 𝒮𝓎𝓈𝓉𝑒𝓂 🧸
┣ ❯ 🤍 .𝘁𝗮𝗴𝗮𝗹𝗹
┣ ❯ 🤍 .𝗵𝗶𝗱𝗲𝘁𝗮𝗴
┣ ❯ 🤍 .𝗴𝗵𝗼𝘀𝘁𝗽𝗶𝗻𝗴
┊
╭━━ 💖 𝐹𝓊𝓃 & 𝐸𝓍𝓉𝓇𝒶𝓈 🌸
┣ ❯ 🎀 .𝗷𝗼𝗸𝗲
┣ ❯ 🎀 .𝗾𝘂𝗼𝘁𝗲
┣ ❯ 🎀 .𝗳𝗮𝗰𝘁
┣ ❯ 🎀 .𝗽𝗶𝗻𝗴
┣ ❯ 🎀 .𝘁𝗶𝗺𝗲
┣ ❯ 🎀 .𝗺𝗲𝗻𝘂
┊
╭━━ 🛡️ 𝒪𝓌𝓃𝑒𝓇 𝒵𝑜𝓃𝑒 👑
┣ ❯ 🔐 .𝗯𝗹𝗼𝗰𝗸
┣ ❯ 🔐 .𝘂𝗻𝗯𝗹𝗼𝗰𝗸
╰ ❯ 🔐 .𝗯𝘂𝗹𝗸
┊
╰━━━━ ⟪ 🤍 𝓔𝓷𝓳𝓸𝔂 𝓑𝓸𝓽 🤍 ⟫ ━━━━╯`;

        // Message Bhejna
        await sock.sendMessage(remoteJid, { text: menuText }, { quoted: m });
    }
};